# Install from bundle file
# brew bundle --file=~/.config/.Brewfile

# Cleanup anything else
# brew bundle cleanup --zap --force --file=~/.config/.Brewfile

# Write brew file
# brew bundle dump --force --file=./.Brewfile

# FINALOOP
tap "syncdk/yawsso"
# Manage multiple Node.js versions
brew "nvm"
brew "awscli"
brew "syncdk/yawsso/yawsso"
# brew install ariga/cli/atlas@0.29.2 # installed manually, to uninstall it manually too
# VPN
cask "tailscale-app"
# brew "pnpm@8" # insatlled manually with npm -g, so uninstall it with npm -g too
# Team communication and collaboration software
cask "slack"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook" #
# Video communication and virtual meeting platform
cask "zoom"
# Chrome
cask "google-chrome"

# Mac App Store command-line interface
brew "mas"
# Chromium based browser
cask "arc"
# App to write, plan, collaborate, and get organised
cask "notion"
# Messaging app with a focus on speed and security
cask "telegram"
# Obsidian
cask "obsidian"
# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
# ZSH tools
brew "zsh-vi-mode"

# Secure runtime for JavaScript and TypeScript
brew "oven-sh/bun/bun"
# Clojure 
brew "clojure"
# JavaScript IDE
cask "webstorm"
# Cursor
cask "cursor"
# Rust-based terminal
cask "warp"
# Databases and SQL IDE
# neovim
brew "neovim"
cask "datagrip"
# App to build and share containerised applications and microservices
cask "docker-desktop"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Utility to hide menu bar items
cask "hiddenbar"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool-desktop"
# mas "Hidden Bar", id: 1452453066 # Do I need it?
mas "OS Cleaner Pro", id: 1084211765
